{
    "cpu_types": {
        "text": "<em>This is not a comprehensive list</em><br><br><strong>CPU (Central Processing Unit)</strong>: The generic term for ICs that implement a general-purpose computer, typically refers to those used in high-end applications like PCs and TVs which run at high clock speeds (GHz range) and don't have integrated RAM. <br>For example, the AMD FX-6300 (PC CPU) or ARM Cortex-A53 (embedded CPU) .<br><br><strong>MCU (Microcontroller Unit)</strong>: The same base architecture as a CPU, but with integrated RAM, EEPROM and run at lower clock speeds (MHz range). Used for simple devices like a mouse and keyboard.<br>For example, the STM32F4.<br><br><strong>DSP (Digital Signal Processor)</strong>: A CPU with special instructions for mathematical operations. These chips excel at repetitive math-intensive tasks required in signal processing applications.<br>For example, the Texas Instruments TMS320C6000.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "awareness_keyboard": {
        "text": "",
        "media": "awareness_keyboard.gif",
        "alt": "Custom mechanical keyboard with programmable RGB lighting",
        "credit": ""
    },
    "casio_watch": {
        "text": "",
        "media": "casio_watch.png",
        "alt": "Classic Casio digital watch",
        "credit": ""
    },
    "ecu": {
        "text": "",
        "media": "ecu.jpg",
        "alt": "Automotive Engine Control Unit (ECU)",
        "credit": ""
    },
    "soviet_seeker": {
        "text": "",
        "media": "soviet_seeker.gif",
        "alt": "Soviet heat-seeking missile guidance system",
        "credit": ""
    },
    "isa": {
        "text": "The ISA defines, along <em>many</em> other things, both the text and the binary representation of the machine instructions.<br><br>The text-form is used to write programs directly in machine language, which takes the name of <strong>assembly language</strong>. To execute it on the CPU, it then needs to be translated via an <em>assembler</em>, to the binary representation.<br><br>Some of the most common CPU instructions are:<br><em>(R = CPU register)</em><br>- <strong>ADD R1, R2, R3</strong>: (R1 = R2 + R3)<br>- <strong>MUL R1, R2, R3</strong>: (R1 = R2 × R3)<br>- <strong>CMP R1, R2</strong>: Compare two values<br>- <strong>JMP 0x1000</strong>: Jump to the given memory address",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "ES": {
        "text": "Embedded System",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "computers": {
        "text": "Computers in the sense of machines that perform computation, not personal computers",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "CU": {
        "text": "Computational Unit",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "CPU": {
        "text": "Central Processing Unit",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "ASIC": {
        "text": "Application Specific Integrated Circuit",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "hardware_bug": {
        "text": "These are called <strong>hardware bugs</strong> or <strong>silicon bugs</strong>. Manufacturers document known hardware bugs in a document called <strong>IC Errata</strong> (or Silicon Errata), which lists all identified design flaws, their impact, and any workarounds. Engineers must consult the errata when designing systems to avoid triggering known bugs.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "FPGA": {
        "text": "Field-Programmable Gate Array",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "fpga_partial_reconfiguration": {
        "text": "Some FPGAs support <strong>partial reconfiguration</strong>, allowing parts of the FPGA fabric to be reconfigured while other parts continue to operate. This enables dynamic hardware adaptation during runtime.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "off_device_app": {
        "text": "",
        "media": "perixx_mx_1000_app.jpg",
        "alt": "Perixx MX-1000 mouse configuration software",
        "credit": ""
    },
    "embedded_software_onboard": {
        "text": "Devices with sufficient processing power typically run a full operating system (Linux, Android) which provide rich graphical user interfaces, making the device intuitive to use without requiring any off-device software.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "ann": {
        "text": "",
        "media": "ann.jpg",
        "alt": "Analog multimeter",
        "credit": ""
    },
    "dmm": {
        "text": "",
        "media": "dmm.jpg",
        "alt": "Digital multimeter",
        "credit": ""
    },
    "oscilloscope": {
        "text": "Two channel oscilloscope measuring the output of a circuit",
        "media": "oscilloscope.jpg",
        "alt": "Two-channel oscilloscope showing waveform",
        "credit": "learn.sparkfun.com"
    },
    "oscilloscope_data_rate": {
        "text": "<strong>Example:<br></strong> To correctly sample a <strong>1 MHz signal</strong>, a minimum of <strong>2 million samples per second</strong> are required (Nyquist theorem). To display all of this data, a digit screen would need to update every <strong>0.5 microseconds</strong>, far beyond what a simple digit display can handle, let alone a human reading it.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "oscilloscope_channels": {
        "text": "<strong>Input Channels</strong><br><br>The maximum number of signals an oscilloscope can measure and display simultaneously. Entry-level oscilloscopes typically have 2 to 4 channels, while professional models have more. Multiple channels let you compare signals side-by-side, essential for debugging communication protocols.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "signal_analysis_capabilities": {
        "text": "<strong>Advanced Signal Analysis</strong><br><br>Depending on the model, different math functions are available:<br><br>- <strong>FFT (Fast Fourier Transform)</strong>: Converts time-domain signals to frequency domain, revealing harmonic content and noise characteristics<br>- <strong>Math Functions</strong>: Perform operations like addition, subtraction, integration, differentiation on signals<br>- <strong>Automated Measurements</strong>: Calculate rise time, fall time, jitter, phase differences automatically",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "oscilloscope_signal_visualization": {
        "text": "The graphical representation makes it easy to understand signal behavior at a glance. While signals can also be analyzed by computers using math, the oscilloscope is designed to be an hands-on debugging.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "waves": {
        "text": "From top to bottom, a sine wave, a square wave, and a triangular wave.<br>Note how, if the period of the multimeter sampling would correspond with the middle point of the on part of the square wave, the multimeter would always read the maximum voltage, completely hiding the switching behavior of all three signals",
        "media": "waves.jpg",
        "alt": "",
        "credit": ""
    },
    "es_nuances": {
        "text": "This is true for both the software and the hardware side.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "signal_integrity_issues": {
        "text": "<strong>Noise</strong>: General unwanted electrical interference that appears on top of the signal.<br><br><strong>Ringing</strong>: Oscillations that occur when a signal changes value fast.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "signal_characteristics": {
        "text": "<strong>Frequency</strong>: How many times per second the signal repeats (measured in Hz).<br><br><strong>Rise/Fall Time</strong>: How quickly a signal transitions between low and high states, important for high-speed digital circuits.<br><br><strong>Timing Relationships</strong>: Phase differences and synchronization between multiple signals.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "flash_program": {
        "text": "Writing the program binary file on the MCU EEPROM",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "PCB_image": {
        "text": "",
        "media": "awareness_macropad_pcb.jpg",
        "alt": "",
        "credit": ""
    },
    "PCB": {
        "text": "Printed Circuit Board",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "embedded": {
        "text": "",
        "media": "embedded.gif",
        "alt": "",
        "credit": ""
    },
    "IC": {
        "text": "<strong>Integrated Circuit</strong><br><br>A set of transistors, resistors, and capacitors implemented on a semiconductor material, working together to perform complex functions.<br>Modern integrated circuits contain billions of transistors.",
        "media": "CII_72_silicon_die.jpg",
        "alt": "Die shot of the <a href=\"https://en.wikipedia.org/wiki/Electronics_industry_in_the_Socialist_Republic_of_Romania#History\" target=\"_blank\">CII 72</a>, which comprises two voltage comparators with separate differential inputs.",
        "credit": ""
    },
    "electronic": {
        "text": "It's important to define the distinction between <em>electrical</em> and <em>electronic</em>.<br><br>- <strong>Electrical</strong>: means \"current flowing through wires\", for example motors, simple wirings and lighting.<br>- <strong>Electronic</strong>: means \"current flowing through active components that perform computation\", like diodes, transistor and ultimately computers.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "cpu_non_triviality": {
        "text": "CPUs allow everyone to have a computer for their own needs at low cost: just make as many CPUs as needed and program them differently. It's hard to overstate how much this changed the world.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "softcore": {
        "text": "This assumes the FPGA has sufficient resources (logic blocks, RAM, etc.).<br><br>For example, you can configure an FPGA to be a CPU, which takes the name of <a href=\"https://en.wikipedia.org/wiki/Field-programmable_gate_array#Soft_core\" target=\"_blank\"><strong>softcore</strong></a>. A softcore is a CPU implemented using the programmable logic of an FPGA, rather than as a fixed silicon design.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "logic_block_details": {
        "text": "Both <a href=\"https://en.wikipedia.org/wiki/Combinational_logic\" target=\"_blank\">combinational logic</a> and <a href=\"https://en.wikipedia.org/wiki/Sequential_logic\" target=\"_blank\">sequential logic</a> is possible.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "target_fpga_model": {
        "text": "Different FPGAs have different architectures and resources available (number of CLBs, RAM blocks, etc.), so they need different configurations to yield the same result.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "synthesis_toolchain": {
        "text": "This is akin to how different CPU compilers generate different assembly for the same input code.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "vias": {
        "text": "<strong><a href=\"https://en.wikipedia.org/wiki/Via_(electronics)\" target=\"_blank\">Vias</a></strong><br><br>Small plated holes that connect copper traces on different layers of a PCB, allowing electrical signals to pass between layers.",
        "media": "vias.png",
        "alt": "",
        "credit": "vse.com/blog/how-are-pcb-vias-plated"
    },
    "resistors": {
        "text": "<strong>Resistors</strong><br><br>Electrical components that resist the flow of electrical current, used to control voltage and current levels in a circuit.",
        "media": "resistors.jpg",
        "alt": "",
        "credit": "icdigest.com"
    },
    "capacitors": {
        "text": "<strong>Capacitors</strong><br><br>Electrical components that store electrical energy in an electric field, used for filtering, timing, and energy storage applications.",
        "media": "capacitors.jpg",
        "alt": "",
        "credit": "icdigest.com"
    },
    "inductors": {
        "text": "<strong>Inductors</strong><br><br>Electrical components that store energy in a magnetic field when electrical current flows through them, used for filtering and energy storage.",
        "media": "inductors.jpg",
        "alt": "",
        "credit": "icdigest.com"
    },
    "connectors": {
        "text": "<strong>Connectors</strong><br><br>Physical interfaces that allow electrical connections to be made and broken between different parts of a system, such as USB ports, pin headers, and terminal blocks.",
        "media": "connectors.gif",
        "alt": "",
        "credit": ""
    },
    "soldering_iron": {
        "text": "",
        "media": "soldering_iron.jpg",
        "alt": "",
        "credit": "aixuntech.com"
    },
    "bench_power_supply": {
        "text": "High-end bench power supply with three channels.",
        "media": "bench_power_supply.png",
        "alt": "",
        "credit": "keysight.com"
    },
    "soldering_robot": {
        "media": "soldering_robot.gif",
        "alt": "",
        "credit": "youtube.com/@WellerTools"
    },
    "reflow_oven": {
        "text": "<strong>Reflow Oven</strong><br><br>Industrial ovens that heat PCBs with pre-applied solder paste to precisely controlled temperatures, melting the solder and creating permanent connections between components and the board. Commonly used in mass production of electronics.",
        "media": "reflow_oven.jpg",
        "alt": "",
        "credit": "en.wikipedia.org/wiki/Reflow_oven"
    },
    "dsp_example": {
        "text": "Think of the electronics that controls a RADAR, for example.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "firmware_unchanged": {
        "text": "This is because:<br>- Firmware directly controls the hardware, and the hardware doesn't change: once it's done it's done<br>- Specialized tools are needed to change the firmware on the device, end users don't have them",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "bare_metal_example": {
        "text": "A single line of code can change the voltage level of a single pin of a microcontroller, allowing it, for example, to toggle an LED.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "hardware_capabilities": {
        "text": "Think of systems with many cores, many peripherals.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "system_logic": {
        "text": "Think of a system that is handling multiple input/output data streams over many different communication protocols.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "bench_power_supply_example": {
        "text": "An example is a modern bench power supply: the firmware controls the voltage and current settings based on the front panel buttons and dials, while the software exposes a web interface for remote control and configuration.<br>You might update the software to add new features, but the firmware remains stable (unless a bug is found) as the front panel is always the same.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "ESD_protection": {
        "text": "<strong>ESD Protection</strong><br><br>Electrostatic Discharge protection circuits prevent damage from static electricity. Clamping voltage spikes to safe levels, protects sensitive electronics from the thousands of volts that can build up from simple actions like touching a doorknob.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "reverse_polarity_protection": {
        "text": "<strong>Reverse Polarity Protection</strong><br><br>Prevents damage when power is connected backwards. Reversing power can instantly destroy components.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "overcurrent_protection": {
        "text": "<strong>Overcurrent Protection</strong><br><br>Limits or cuts off current flow when it exceeds safe levels, preventing component damage and fire hazards.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "debugger": {
        "text": "A JLink debugger.<br>On the top side, the debugger is connected via USB to the PC, on the bottom side instead, it's connected to a PCB for programming and debugging.<br> The PC side is always either USB or Ethernet, the device side is device dependant, both in the protocol used and the cable/connectors required.",
        "media": "debugger.jpg",
        "alt": "",
        "credit": ""
    },
    "PCB_manufacturing": {
        "text": "Either chemical etching or CNC milling.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "multilayer_PCB": {
        "text": "Multiple layers are created separately and then laminated together under heat and pressure to form a multi-layer PCB.<br>Layer count is almost always an even number, and most PCBs have either 2, 4, or 6 layers.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "full_os_requirements": {
        "text": "Not all embedded systems can run full-fledged OSes like Linux or Android. These OSes require a <strong>Memory Management Unit (MMU)</strong>, a hardware component that translates virtual addresses to physical addresses.<br><br>The MMU enables each process to have its own isolated address space, which is fundamental to how Linux and Android manage multiple applications. Most microcontrollers lack an MMU, which is why they run bare-metal code or lightweight RTOSes instead.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "pcb_pads": {
        "text": "<strong>PCB Pads</strong><br><br>Exposed metal areas on a PCB where components are soldered. Pads provide both mechanical support and electrical connection between components and the PCB traces.",
        "media": "pcb_pads.jpg",
        "alt": "A capacitor being placed on PCB pads",
        "credit": "mokotechnology.com/"
    },
    "solder_paste": {
        "text": "<strong>Solder Paste</strong><br><br>A sticky mixture of tiny solder balls suspended in flux.<br>Applied to PCB pads before component placement, it melts during the reflow process to create permanent electrical connections.",
        "media": "solder_paste.jpg",
        "alt": "By Lady Ada AKA Limor Fried - https://learn.adafruit.com/assets/168, CC BY-SA 3.0, https://commons.wikimedia.org/w/index.php?curid=32066966",
        "credit": ""
    },
    "reflow": {
        "text": "Watching solder paste melt and components seemingly snap into perfect alignment as surface tension pulls them into place is genuinely fascinating.",
        "media": "reflow.gif",
        "alt": "",
        "credit": ""
    },
    "THT_soldering": {
        "text": "",
        "media": "THT_soldering.gif",
        "alt": "youtube.com/@RobertFeranec",
        "credit": ""
    },
    "smd_scale": {
        "text": "",
        "media": "smd_component_scale.jpg",
        "alt": "",
        "credit": "edn.com"
    },
    "THT_diagram": {
        "text": "Note how the component goes through the PCB and it soldered on the opposite side",
        "media": "THT_diagram.jpg",
        "alt": "",
        "credit": "pcbpower.us"
    },
    "SMD_diagram": {
        "text": "Note how the component is soldered on the surface of the PCB",
        "media": "SMD_diagram.jpg",
        "alt": "",
        "credit": "pcbpower.us"
    },
    "soldering_smd": {
        "text": "",
        "media": "soldering_smd.gif",
        "alt": "",
        "credit": "pcbpower.us"
    },
    "oscilloscope_sampling_frequency": {
        "text": "Sampling frequency (sample rate) determines how many voltage measurements are taken per second (e.g., MSa/s or GSa/s).",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "oscilloscope_bandwidth": {
        "text": "Bandwidth is the maximum frequency at which the oscilloscope can accurately measure signal amplitude.<br><br>This is different from sampling rate, which determines how many voltage measurements are taken per second.<br><br>Both matter: bandwidth limits what frequencies you can see, while sampling rate affects reconstruction quality.",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "ECAD": {
        "text": "Electronic Computer-Aided Design",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "MCAD": {
        "text": "Mechanical Computer-Aided Design",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "CAD": {
        "text": "Computer-Aided Design",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "IDE": {
        "text": "Integrated Development Environment",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "HDL": {
        "text": "Hardware Description Language",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "OS": {
        "text": "Operating System",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "MMU": {
        "text": "Memory Management Unit",
        "media": "",
        "alt": "",
        "credit": ""
    },
    "tooltip": {
        "text": "This is a tooltip example!<br><br><em></em>",
        "media": "starship-superheavy.gif",
        "alt": "The Starship rocket powering to orbit!!!",
        "credit": "tenor.com"
    },
    "solder_paste_applied": {
        "text": "Close up of a ceramic capacitor applied on top of fresh solder paste<br>Reflow will melt the solder paste and create a solid electrical and mechanical connection between the capacitor and the PCB pad below it.",
        "media": "solder_paste_applied.jpg",
        "alt": "",
        "credit": ""
    }
}