{
    "cpu_types": {
        "text": "<strong>CPU (Central Processing Unit)</strong>: The general term for a general-purpose computer IC. Typically run at high clock speeds (GHz range).<br>For example, the ARM Cortex-A53 .<br><br><strong>MCU (Microcontroller Unit)</strong>: The same base architecture as a CPU, but with integrated RAM, EEPROM and run at lower clock speeds (MHz range).<br>For example, the STM32F4.<br><br><strong>DSP (Digital Signal Processor)</strong>: A specialized processor optimized for digital signal processing operations like filtering, FFT, and audio/video processing.<br>For example, the Texas Instruments TMS320C6000.",
        "media": "",
        "alt": ""
    },
    "keyboard": {
        "text": "",
        "media": "pic.png",
        "alt": ""
    },
    "wrist_clock": {
        "text": "",
        "media": "pic.jpg",
        "alt": ""
    },
    "ECU": {
        "text": "",
        "media": "kb.gif",
        "alt": ""
    },
    "SAM_computer": {
        "text": "",
        "media": "kb.gif",
        "alt": ""
    },
    "paw3395": {
        "text": "High-performance gaming optical sensor with 30,000 DPI capability",
        "media": "tooltip.gif"
    },
    "isa": {
        "text": "<strong>Instruction Set Architecture</strong><br><br>The ISA defines the complete set of operations that a CPU can perform, along with how those operations are encoded as binary numbers.<br><br>Examples of common instructions include:<br>- <strong>ADD</strong>: Add two numbers<br>- <strong>MUL</strong>: Multiply two numbers<br>- <strong>CMP</strong>: Compare two values<br>- <strong>JMP</strong>: Jump to a different location in code<br>- <strong>LOAD</strong>: Read data from memory<br>- <strong>STORE</strong>: Write data to memory<br><br>These instructions can be written in <em>assembly language</em> (human-readable text like \"ADD R1, R2, R3\"), but the CPU actually executes them as binary machine code (e.g., 0x4A320001). The assembler translates assembly text to binary.",
        "media": ""
    },
    "ES": {
        "text": "Embedded System",
        "media": ""
    },
    "heat_seeking_missile": {
        "text": "",
        "media": "",
        "alt": ""
    },
    "PCB": {
        "text": "",
        "media": "",
        "alt": ""
    },
    "IC": {
        "text": "<strong>Integrated Circuit</strong><br><br>A set of electronic circuits on a small flat piece of semiconductor material (usually silicon). An IC can contain billions of transistors, resistors, and capacitors working together to perform complex functions.",
        "media": "CII_72_silicon_die.jpg"
    },
    "electronic": {
        "text": "It's important to define the distinction between <em>electrical</em> and <em>electronic</em>.<br><br>- <strong>Electrical</strong>: means \"current flowing through wires\", for example motors, simple wirings and lighting.<br>- <strong>Electronic</strong>: means \"current flowing through active components that perform computation\", like diodes, transistor and ultimately computers.",
        "media": ""
    },
    "cpu_non_triviality": {
        "text": "CPUs allow everyone to have a computer for their own needs at low cost: just make as many CPUs as needed and program them differently. It's hard to overstate how much this changed the world.",
        "media": ""
    },
    "softcore": {
        "text": "<italics>This assumes the FPGA has sufficient resources (logic blocks, RAM, etc.).</italics><br><br>For example, you can configure an FPGA to be a CPU, which takes the name of <a href=\"https://en.wikipedia.org/wiki/Field-programmable_gate_array#Soft_core\" target=\"_blank\"><strong>softcore</strong></a>. A softcore is a CPU implemented using the programmable logic of an FPGA, rather than as a fixed silicon design.",
        "media": ""
    },
    "logic_block_details": {
        "text": "Logic blocks can implement <a href=\"https://en.wikipedia.org/wiki/Combinational_logic\" target=\"_blank\">combinational logic</a> (via lookup tables) and typically include flip-flops for <a href=\"https://en.wikipedia.org/wiki/Sequential_logic\" target=\"_blank\">sequential logic</a> and state storage.",
        "media": ""
    },
    "target_fpga_model": {
        "text": "Different FPGAs have different architectures and resources available (number of logic blocks, RAM blocks, etc.), so they need different configurations to yield the same result.",
        "media": ""
    },
    "synthesis_toolchain": {
        "text": "This is akin to how different CPU compilers generate different assembly for the same input code.",
        "media": ""
    },
    "vias": {
        "text": "<strong>Vias</strong><br><br>Small plated holes that connect copper traces on different layers of a PCB, allowing electrical signals to pass between layers.",
        "media": ""
    },
    "resistors": {
        "text": "<strong>Resistors</strong><br><br>Electronic components that resist the flow of electrical current, used to control voltage and current levels in a circuit.",
        "media": ""
    },
    "capacitors": {
        "text": "<strong>Capacitors</strong><br><br>Electronic components that store electrical energy in an electric field, used for filtering, timing, and energy storage applications.",
        "media": ""
    },
    "connectors": {
        "text": "<strong>Connectors</strong><br><br>Physical interfaces that allow electrical connections to be made and broken between different parts of a system, such as USB ports, pin headers, and terminal blocks.",
        "media": ""
    },
    "soldering_iron": {
        "text": "",
        "media": "soldering_iron.gif",
        "alt": ""
    },
    "soldering_robot": {
        "text": "",
        "media": "soldering_robot.gif",
        "alt": ""
    },
    "reflow_ovens": {
        "text": "<strong>Reflow Ovens</strong><br><br>Industrial ovens that heat PCBs with pre-applied solder paste to precisely controlled temperatures, melting the solder and creating permanent connections between components and the board. Commonly used in mass production of electronics.",
        "media": "reflow_ovens.gif",
        "alt": ""
    },
    "perfboard": {
        "text": "<strong>Perfboard</strong><br><br>A prototyping board with pre-drilled holes arranged in a grid pattern. Components are inserted from one side and soldered on the other, with connections made by soldering component leads together or using wire jumpers. Unlike breadboards, perfboard connections are permanent.",
        "media": "perfboard.png",
        "alt": ""
    },
    "intermediate_circuitry_input": {
        "text": "<strong>Intermediate Circuitry for Inputs</strong><br><br>Sometimes sensors can't connect directly to the computational unit and need interface circuitry in between.<br><br>For example, to measure a 12V battery voltage with a microcontroller that only tolerates 3.3V on its pins, you'd use a <em>voltage divider</em> - two resistors in series that scale down the voltage to a safe range (e.g., 12V → 3V) before connecting to the MCU's analog input pin.",
        "media": ""
    },
    "intermediate_circuitry_output": {
        "text": "<strong>Intermediate Circuitry for Outputs</strong><br><br>Sometimes output devices can't be driven directly by the computational unit and need interface circuitry in between.<br><br>For example, high-power LEDs require much more current than a microcontroller pin can provide (typically 20-40mA max). An <em>LED driver</em> circuit takes the low-power control signal from the MCU and uses it to switch higher currents (hundreds of mA or more) through the LED safely.",
        "media": ""
    }
}