{
    "cpu_types": {
        "text": "<strong>CPU (Central Processing Unit)</strong>: The general term for a general-purpose computer. Typically run at high clock speeds (GHz range).<br><strong>MCU (Microcontroller Unit)</strong>: The same base architecture as a CPu complete computer system on a single chip, including CPU, memory, and I/O peripherals. For example, the STM32F4. MCUs usually operate at much lower clock speeds (MHz range) compared to CPUs, focusing on low power and real-time control.<br><strong>DSP (Digital Signal Processor)</strong>: A specialized processor optimized for digital signal processing operations like filtering, FFT, and audio/video processing. For example, Texas Instruments TMS320C6000.",
        "media": "",
        "alt": ""
    },
    "keyboard": {
        "text": "",
        "media": "pic.png",
        "alt": ""
    },
    "wrist_clock": {
        "text": "",
        "media": "pic.jpg",
        "alt": ""
    },
    "ECU": {
        "text": "",
        "media": "kb.gif",
        "alt": ""
    },
    "SAM_computer": {
        "text": "",
        "media": "kb.gif",
        "alt": ""
    },
    "paw3395": {
        "text": "High-performance gaming optical sensor with 30,000 DPI capability",
        "media": "tooltip.gif"
    },
    "isa": {
        "text": "<strong>Instruction Set Architecture</strong><br><br>The set of instructions that a processor can execute",
        "media": ""
    },
    "ES": {
        "text": "Embedded System",
        "media": ""
    },
    "heat_seeking_missile": {
        "text": "",
        "media": "",
        "alt": ""
    },
    "PCB": {
        "text": "",
        "media": "",
        "alt": ""
    },
    "IC": {
        "text": "<strong>Integrated Circuit</strong><br><br>A set of electronic circuits on a small flat piece of semiconductor material (usually silicon). An IC can contain billions of transistors, resistors, and capacitors working together to perform complex functions.",
        "media": "CII_72_silicon_die.jpg"
    },
    "electronic": {
        "text": "It's important to define the distinction between <em>electrical</em> and <em>electronic</em>.<br><br>- <strong>Electrical</strong>: means \"current flowing through wires\", for example motors, simple wirings and lighting.<br>- <strong>Electronic</strong>: means \"current flowing through active components that perform computation\", like diodes, transistor and ultimately computers.",
        "media": ""
    },
    "cpu_non_triviality": {
        "text": "This is not a trivial thing: considering that integrated circuits are machines, the bare fact that a general purpose machine is manufacturable makes it so that everyone can have a computer for their own needs at low cost: make 100 CPUs and program them differently. I cannot overstate how much this changed the world.",
        "media": ""
    }
}